; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-4-10)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	)
(:init
	(at plane1 city5)
	(= (capacity plane1) 2791)
	(= (fuel plane1) 762)
	(= (slow-burn plane1) 1)
	(= (fast-burn plane1) 2)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 2)
	(at plane2 city3)
	(= (capacity plane2) 7479)
	(= (fuel plane2) 1534)
	(= (slow-burn plane2) 3)
	(= (fast-burn plane2) 8)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 1)
	(at plane3 city4)
	(= (capacity plane3) 9224)
	(= (fuel plane3) 347)
	(= (slow-burn plane3) 4)
	(= (fast-burn plane3) 11)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 2)
	(at plane4 city0)
	(= (capacity plane4) 5597)
	(= (fuel plane4) 1921)
	(= (slow-burn plane4) 2)
	(= (fast-burn plane4) 4)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 3)
	(at person1 city1)
	(at person2 city4)
	(at person3 city5)
	(at person4 city2)
	(at person5 city5)
	(at person6 city1)
	(at person7 city1)
	(at person8 city4)
	(at person9 city4)
	(at person10 city5)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 825)
	(= (distance city0 city2) 762)
	(= (distance city0 city3) 594)
	(= (distance city0 city4) 792)
	(= (distance city0 city5) 848)
	(= (distance city0 city6) 569)
	(= (distance city1 city0) 825)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 926)
	(= (distance city1 city3) 785)
	(= (distance city1 city4) 953)
	(= (distance city1 city5) 869)
	(= (distance city1 city6) 610)
	(= (distance city2 city0) 762)
	(= (distance city2 city1) 926)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 707)
	(= (distance city2 city4) 782)
	(= (distance city2 city5) 549)
	(= (distance city2 city6) 892)
	(= (distance city3 city0) 594)
	(= (distance city3 city1) 785)
	(= (distance city3 city2) 707)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 861)
	(= (distance city3 city5) 988)
	(= (distance city3 city6) 794)
	(= (distance city4 city0) 792)
	(= (distance city4 city1) 953)
	(= (distance city4 city2) 782)
	(= (distance city4 city3) 861)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 952)
	(= (distance city4 city6) 693)
	(= (distance city5 city0) 848)
	(= (distance city5 city1) 869)
	(= (distance city5 city2) 549)
	(= (distance city5 city3) 988)
	(= (distance city5 city4) 952)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 863)
	(= (distance city6 city0) 569)
	(= (distance city6 city1) 610)
	(= (distance city6 city2) 892)
	(= (distance city6 city3) 794)
	(= (distance city6 city4) 693)
	(= (distance city6 city5) 863)
	(= (distance city6 city6) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city1)
	(at plane2 city2)
	(at person2 city1)
	(at person3 city1)
	(at person4 city2)
	(at person5 city3)
	(at person6 city6)
	(at person7 city4)
	(at person8 city6)
	(at person9 city4)
	(at person10 city2)
	))

(:metric minimize (+ (* 3 (total-time))  (* 2 (total-fuel-used))))
)

; plan
1. (fly plane1 city5 city2)
   deleted: (at plane1 city5)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 0 to 549, (fuel plane1) from 762 to 213
   goals met: 2 of 11
2. (refuel plane2 city3)
   changed: (fuel plane2) from 1534 to 7479
   goals met: 2 of 11
3. (fly plane4 city0 city3)
   deleted: (at plane4 city0)
   added: (at plane4 city3)
   changed: (total-fuel-used) from 549 to 1737, (fuel plane4) from 1921 to 733
   goals met: 2 of 11
4. (refuel plane1 city2)
   changed: (fuel plane1) from 213 to 2791
   goals met: 2 of 11
5. (zoom plane2 city3 city2)
   deleted: (at plane2 city3)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 1737 to 7393, (fuel plane2) from 7479 to 1823
   goals met: 3 of 11
6. (zoom plane1 city2 city5)
   deleted: (at plane1 city2)
   added: (at plane1 city5)
   changed: (total-fuel-used) from 7393 to 8491, (fuel plane1) from 2791 to 1693
   goals met: 3 of 11
7. (board person5 plane1 city5)
   deleted: (at person5 city5)
   added: (in person5 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 3 of 11
8. (board person3 plane1 city5)
   deleted: (at person3 city5)
   added: (in person3 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 3 of 11
9. (board person10 plane1 city5)
   deleted: (at person10 city5)
   added: (in person10 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 3 of 11
10. (refuel plane3 city4)
   changed: (fuel plane3) from 347 to 9224
   goals met: 3 of 11
11. (board person2 plane3 city4)
   deleted: (at person2 city4)
   added: (in person2 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 3 of 11
12. (board person8 plane3 city4)
   deleted: (at person8 city4)
   added: (in person8 plane3)
   changed: (onboard plane3) from 1 to 2
   goals met: 3 of 11
13. (fly plane3 city4 city1)
   deleted: (at plane3 city4)
   added: (at plane3 city1)
   changed: (total-fuel-used) from 8491 to 12303, (fuel plane3) from 9224 to 5412
   goals met: 3 of 11
14. (debark person2 plane3 city1)
   deleted: (in person2 plane3)
   added: (at person2 city1)
   changed: (onboard plane3) from 2 to 1
   goals met: 4 of 11
15. (board person6 plane3 city1)
   deleted: (at person6 city1)
   added: (in person6 plane3)
   changed: (onboard plane3) from 1 to 2
   goals met: 4 of 11
16. (fly plane3 city1 city6)
   deleted: (at plane3 city1)
   added: (at plane3 city6)
   changed: (total-fuel-used) from 12303 to 14743, (fuel plane3) from 5412 to 2972
   goals met: 4 of 11
17. (debark person6 plane3 city6)
   deleted: (in person6 plane3)
   added: (at person6 city6)
   changed: (onboard plane3) from 2 to 1
   goals met: 5 of 11
18. (debark person8 plane3 city6)
   deleted: (in person8 plane3)
   added: (at person8 city6)
   changed: (onboard plane3) from 1 to 0
   goals met: 6 of 11
19. (fly plane1 city5 city2)
   deleted: (at plane1 city5)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 14743 to 15292, (fuel plane1) from 1693 to 1144
   goals met: 6 of 11
20. (debark person10 plane1 city2)
   deleted: (in person10 plane1)
   added: (at person10 city2)
   changed: (onboard plane1) from 3 to 2
   goals met: 7 of 11
21. (fly plane1 city2 city3)
   deleted: (at plane1 city2)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 15292 to 15999, (fuel plane1) from 1144 to 437
   goals met: 7 of 11
22. (refuel plane1 city3)
   changed: (fuel plane1) from 437 to 2791
   goals met: 7 of 11
23. (debark person5 plane1 city3)
   deleted: (in person5 plane1)
   added: (at person5 city3)
   changed: (onboard plane1) from 2 to 1
   goals met: 8 of 11
24. (fly plane1 city3 city1)
   deleted: (at plane1 city3)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 15999 to 16784, (fuel plane1) from 2791 to 2006
   goals met: 9 of 11
25. (debark person3 plane1 city1)
   deleted: (in person3 plane1)
   added: (at person3 city1)
   changed: (onboard plane1) from 1 to 0
   goals met: 10 of 11
26. (board person7 plane1 city1)
   deleted: (at person7 city1)
   added: (in person7 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 10 of 11
27. (fly plane1 city1 city4)
   deleted: (at plane1 city1)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 16784 to 17737, (fuel plane1) from 2006 to 1053
   goals met: 9 of 11
28. (debark person7 plane1 city4)
   deleted: (in person7 plane1)
   added: (at person7 city4)
   changed: (onboard plane1) from 1 to 0
   goals met: 10 of 11
29. (fly plane1 city4 city1)
   deleted: (at plane1 city4)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 17737 to 18690, (fuel plane1) from 1053 to 100
   goals met: 11 of 11
